
<!DOCTYPE html>

<html>
  <head>
    <meta charset="utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Adèles &#8212; Computing with adèles and idèles</title>
    <link rel="stylesheet" href="_static/sage.css" type="text/css" />
    <link rel="stylesheet" href="_static/pygments.css" type="text/css" />
    <script id="documentation_options" data-url_root="./" src="_static/documentation_options.js"></script>
    <script src="_static/jquery.js"></script>
    <script src="_static/underscore.js"></script>
    <script src="_static/doctools.js"></script>
    <script src="_static/language_data.js"></script>
    <script async="async" src="_static/MathJax.js?config=TeX-AMS_HTML-full,../mathjax_sage.js"></script>
    <link rel="index" title="Index" href="genindex.html" />
    <link rel="search" title="Search" href="search.html" />
    <link rel="next" title="Multiplicative \(p\)-adics" href="multiplicative_padic.html" />
    <link rel="prev" title="Infinite Completions of Number Fields" href="completion.html" />
    <link rel="icon" href="_static/sageicon.png" type="image/x-icon" />
    <script src="_static/thebe.js" type="text/javascript"></script>
    <script src="_static/thebe-sage.js" type="text/javascript"></script>

  </head><body>
    <div class="related" role="navigation" aria-label="related navigation">
      <h3>Navigation</h3>
      <ul>
        <li class="right" style="margin-right: 10px">
          <a href="genindex.html" title="General Index"
             accesskey="I">index</a></li>
        <li class="right" >
          <a href="py-modindex.html" title="Python Module Index"
             >modules</a> |</li>
        <li class="right" >
          <a href="multiplicative_padic.html" title="Multiplicative \(p\)-adics"
             accesskey="N">next</a> |</li>
        <li class="right" >
          <a href="completion.html" title="Infinite Completions of Number Fields"
             accesskey="P">previous</a> |</li>
  
    
      <a href="../index.html"><img src="_static/logo_sagemath_black.svg" height="28" style="vertical-align: middle" title="Sage Logo"></a>
    
  
  
        <li class="nav-item nav-item-0"><a href="index.html">Home</a> &#187;</li>

        <li class="nav-item nav-item-this"><a href="">Adèles</a></li> 
      </ul>
    </div>  

    <div class="document">
      <div class="documentwrapper">
        <div class="bodywrapper">
          <div class="body" role="main">
            
  <div class="section" id="module-adeles.adele">
<span id="adeles"></span><h1>Adèles<a class="headerlink" href="#module-adeles.adele" title="Permalink to this headline">¶</a></h1>
<p>Adèles of Number Fields</p>
<p>Let <span class="math notranslate nohighlight">\(K = \QQ(\alpha)\)</span> be the number field generated by <span class="math notranslate nohighlight">\(\alpha\)</span> over <span class="math notranslate nohighlight">\(\QQ\)</span>. Let
<span class="math notranslate nohighlight">\(O\)</span> be the ring of integers of <span class="math notranslate nohighlight">\(K\)</span>. We define a <em>finite prime</em> of <span class="math notranslate nohighlight">\(K\)</span> to be a
prime ideal of <span class="math notranslate nohighlight">\(O\)</span>. An <em>infinite prime</em> of <span class="math notranslate nohighlight">\(K\)</span> is an embedding <span class="math notranslate nohighlight">\(\phi: K \to \CC\)</span>
such that <span class="math notranslate nohighlight">\(\phi(\alpha) \geq 0\)</span>. By a <em>prime</em> of <span class="math notranslate nohighlight">\(K\)</span> we shall mean either a
finite or an infinite prime of <span class="math notranslate nohighlight">\(K\)</span>.</p>
<p>The set of primes of <span class="math notranslate nohighlight">\(K\)</span> corresponds bijectively to the set of equivalence
classes of absolute values on <span class="math notranslate nohighlight">\(K\)</span>. For <span class="math notranslate nohighlight">\(p\)</span> a prime of <span class="math notranslate nohighlight">\(K\)</span>, we let the field of
<span class="math notranslate nohighlight">\(p\)</span>-adic numbers be the completion of <span class="math notranslate nohighlight">\(K\)</span> with respect to a corresponding
absolute value and we denote it by <span class="math notranslate nohighlight">\(K_p\)</span>.</p>
<p>For <span class="math notranslate nohighlight">\(p\)</span> a finite prime of <span class="math notranslate nohighlight">\(K\)</span>, we denote the (normalized) valuation on <span class="math notranslate nohighlight">\(K_p\)</span> by
<span class="math notranslate nohighlight">\(ord_p: K_p \to \ZZ \cup \{\infty\}\)</span>, setting <span class="math notranslate nohighlight">\(ord_p(0) = \infty\)</span>. We denote
the corresponding valuation ring by <span class="math notranslate nohighlight">\(O_p\)</span> and call it the ring of <span class="math notranslate nohighlight">\(p\)</span>-adic
integers. For <span class="math notranslate nohighlight">\(p\)</span> an infinite prime of <span class="math notranslate nohighlight">\(K\)</span> we set <span class="math notranslate nohighlight">\(O_p = K_p\)</span>.</p>
<p>The <em>adèle ring</em> <span class="math notranslate nohighlight">\(\Bold{A}_K\)</span> of <span class="math notranslate nohighlight">\(K\)</span> is usually defined as the restricted
product <span class="math notranslate nohighlight">\(\prod_p' K_p\)</span> with <span class="math notranslate nohighlight">\(p\)</span> ranging over all primes of <span class="math notranslate nohighlight">\(K\)</span> and the
restricted product taken with respect to the open subrings <span class="math notranslate nohighlight">\(O_p\)</span>. Concretely,
that means</p>
<div class="math notranslate nohighlight">
\[\Bold{A}_K = \left\{ (x_p)_p \in \prod_p K_p : x_p \in O_p
              \text{ for all but finitely many } p \right\}\]</div>
<p>Let <span class="math notranslate nohighlight">\((r,s)\)</span> denote the signature of <span class="math notranslate nohighlight">\(K\)</span>. We will view <span class="math notranslate nohighlight">\(\Bold{A}_K\)</span> as the ring</p>
<div class="math notranslate nohighlight">
\[\Bold{A}_K = \prod_{i=1}^r \RR \times \prod_{j=1}^s \CC \times \hat{K}\]</div>
<p>where the infinite primes of <span class="math notranslate nohighlight">\(K\)</span> are ordered according to <code class="docutils literal notranslate"><span class="pre">K.places()</span></code> and
the ring of profinite <span class="math notranslate nohighlight">\(K\)</span>-numbers <span class="math notranslate nohighlight">\(\hat{K}\)</span> is identified with the finite adèle
ring in the natural way (cf. [Her2021] Section 3.4).</p>
<p>This point of view leads us to define a <span class="math notranslate nohighlight">\(K\)</span>-adèle in SageMath to consist out of
an <em>infinite part</em> and a <em>finite part</em>; the infinite part is a list of length
<span class="math notranslate nohighlight">\(r+s\)</span>, where the first <span class="math notranslate nohighlight">\(r\)</span> entries are <code class="docutils literal notranslate"><span class="pre">RealInterval</span></code> instances and the last
<span class="math notranslate nohighlight">\(s\)</span> entries are <code class="docutils literal notranslate"><span class="pre">ComplexInterval</span></code> instances and the finite part is a profinite
<span class="math notranslate nohighlight">\(K\)</span>-number. The <em>represented subset</em> of such an adèle <span class="math notranslate nohighlight">\(((x_1, ..., x_{r+s}), y)\)</span>
is given by</p>
<div class="math notranslate nohighlight">
\[\prod_{i=1}^{r+s} R(x_i) \times R(y)\]</div>
<p>where <span class="math notranslate nohighlight">\(R(x_i)\)</span> denotes the interval in <span class="math notranslate nohighlight">\(\RR\)</span> or <span class="math notranslate nohighlight">\(\CC\)</span> that <span class="math notranslate nohighlight">\(x_i\)</span> represents and
<span class="math notranslate nohighlight">\(R(y)\)</span> denotes the represented subset in <span class="math notranslate nohighlight">\(\hat{K}\)</span> of <span class="math notranslate nohighlight">\(y\)</span>.</p>
<div class="section" id="examples-with-qq-adeles">
<h2>Examples with <span class="math notranslate nohighlight">\(\QQ\)</span>-adèles<a class="headerlink" href="#examples-with-qq-adeles" title="Permalink to this headline">¶</a></h2>
<p>Let’s create the adèle ring of <span class="math notranslate nohighlight">\(\QQ\)</span>:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">A</span> <span class="o">=</span> <span class="n">Adeles</span><span class="p">(</span><span class="n">QQ</span><span class="p">);</span> <span class="n">A</span>
<span class="n">Adèle</span> <span class="n">Ring</span> <span class="n">of</span> <span class="n">Rational</span> <span class="n">Field</span>
</pre></div>
</div>
<p>And let’s create some adèles:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: a = A(3.14, Qhat(1/3, 14)); a
(3.1400000000000002?, 1/3 mod 14)
sage: b = A(1.5, Qhat(2, 6)); b
(1.5000000000000000?, 2 mod 6)
sage: c = A(-1, -1); c
(-1, -1)
</pre></div>
</div>
<p>As you can see, the adèles are printed using their infinite and finite parts.</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: a.infinite_part()
[3.1400000000000002?]
sage: a.finite_part()
1/3 mod 14
</pre></div>
</div>
<p>Arithmetic is done component-wise:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: a + b
(4.640000000000000?, 1/3 mod 2)
sage: a - c
(4.140000000000000?, 4/3 mod 14)
sage: b * a
(4.710000000000000?, 2/3 mod 2)
sage: a / c
(-3.1400000000000002?, 41/3 mod 14)
</pre></div>
</div>
<p>We can ask the projections of our adèle to various <span class="math notranslate nohighlight">\(p\)</span>-adic fields, as well as
<span class="math notranslate nohighlight">\(\RR\)</span>:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: a[2]
1 + O(2)
sage: a[3]
3^-1 + O(3^0)
sage: a[5]
O(5^0)
sage: a[7]
5 + O(7)
sage: a[oo]
3.1400000000000002?
</pre></div>
</div>
<p>We can also create adèles over <span class="math notranslate nohighlight">\(\QQ\)</span> using <span class="math notranslate nohighlight">\(p\)</span>-adic numbers:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: d_2 = Qp(2)(3, 3); d_2
1 + 2 + O(2^3)
sage: d_3 = Qp(3)(1/6, 2); d_3
2*3^-1 + 1 + 3 + O(3^2)
sage: d_5 = Qp(5)(1/50, -1); d_5
3*5^-2 + O(5^-1)
sage: d = A([9.7, d_2, d_3, d_5]); d
(9.6999999999999993?, 809/75 mod 72/5)
sage: d[2]
1 + 2 + O(2^3)
sage: d[3]
2*3^-1 + 1 + 3 + O(3^2)
sage: d[5]
3*5^-2 + O(5^-1)
sage: d[7]
O(7^0)
</pre></div>
</div>
<p>This <span class="math notranslate nohighlight">\(p\)</span>-adic functionality is however only available for adèles over <span class="math notranslate nohighlight">\(\QQ\)</span>, not
for <span class="math notranslate nohighlight">\(K\)</span>-adèles for <span class="math notranslate nohighlight">\(K\)</span> a non-trivial number field. This is because SageMath
currently does not have an implementation of <span class="math notranslate nohighlight">\(p\)</span>-adic numbers for <span class="math notranslate nohighlight">\(p\)</span> finite
primes of number fields in general.</p>
</div>
<div class="section" id="adeles-over-number-fields">
<h2>Adèles over Number Fields<a class="headerlink" href="#adeles-over-number-fields" title="Permalink to this headline">¶</a></h2>
<p>Let’s create a non-trivial number field and the corresponding adèle ring.</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">K</span><span class="o">.&lt;</span><span class="n">a</span><span class="o">&gt;</span> <span class="o">=</span> <span class="n">NumberField</span><span class="p">(</span><span class="n">x</span><span class="o">^</span><span class="mi">5</span> <span class="o">-</span> <span class="n">x</span><span class="o">^</span><span class="mi">3</span> <span class="o">-</span> <span class="mi">2</span><span class="o">*</span><span class="n">x</span> <span class="o">+</span> <span class="mi">1</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">Khat</span> <span class="o">=</span> <span class="n">ProfiniteNumbers</span><span class="p">(</span><span class="n">K</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">Ak</span> <span class="o">=</span> <span class="n">Adeles</span><span class="p">(</span><span class="n">K</span><span class="p">);</span> <span class="n">Ak</span>
<span class="n">Adèle</span> <span class="n">Ring</span> <span class="n">of</span> <span class="n">Number</span> <span class="n">Field</span> <span class="ow">in</span> <span class="n">a</span> <span class="k">with</span> <span class="n">defining</span> <span class="n">polynomial</span> <span class="n">x</span><span class="o">^</span><span class="mi">5</span> <span class="o">-</span> <span class="n">x</span><span class="o">^</span><span class="mi">3</span> <span class="o">-</span> <span class="mi">2</span><span class="o">*</span><span class="n">x</span> <span class="o">+</span> <span class="mi">1</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">K</span><span class="o">.</span><span class="n">signature</span><span class="p">()</span>
<span class="p">(</span><span class="mi">3</span><span class="p">,</span> <span class="mi">1</span><span class="p">)</span>
</pre></div>
</div>
<p>The signature of <span class="math notranslate nohighlight">\(K\)</span> is <span class="math notranslate nohighlight">\((3, 1)\)</span>, hence we need three reals and one complex
number for our <span class="math notranslate nohighlight">\(K\)</span>-adèles:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">b</span> <span class="o">=</span> <span class="n">Ak</span><span class="p">([</span><span class="o">-</span><span class="mi">1</span><span class="p">,</span> <span class="mi">1</span><span class="p">,</span> <span class="mi">2</span><span class="p">,</span> <span class="mi">4</span><span class="o">*</span><span class="n">I</span><span class="p">],</span> <span class="n">Khat</span><span class="p">(</span><span class="n">a</span><span class="p">,</span> <span class="mi">100</span><span class="o">/</span><span class="mi">3</span><span class="p">));</span> <span class="n">b</span>
<span class="p">(</span><span class="o">-</span><span class="mi">1</span><span class="p">,</span> <span class="mi">1</span><span class="p">,</span> <span class="mi">2</span><span class="p">,</span> <span class="mi">4</span><span class="o">*</span><span class="n">I</span><span class="p">,</span> <span class="n">a</span> <span class="n">mod</span> <span class="p">(</span><span class="mi">100</span><span class="o">/</span><span class="mi">3</span><span class="p">))</span>
</pre></div>
</div>
<p>The order of the <span class="math notranslate nohighlight">\(\RR\)</span>’s and <span class="math notranslate nohighlight">\(\CC\)</span>’s is given by <code class="docutils literal notranslate"><span class="pre">K.places()</span></code>:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">K</span><span class="o">.</span><span class="n">places</span><span class="p">()</span>
<span class="p">[</span><span class="n">Ring</span> <span class="n">morphism</span><span class="p">:</span>
   <span class="n">From</span><span class="p">:</span> <span class="n">Number</span> <span class="n">Field</span> <span class="ow">in</span> <span class="n">a</span> <span class="k">with</span> <span class="n">defining</span> <span class="n">polynomial</span> <span class="n">x</span><span class="o">^</span><span class="mi">5</span> <span class="o">-</span> <span class="n">x</span><span class="o">^</span><span class="mi">3</span> <span class="o">-</span> <span class="mi">2</span><span class="o">*</span><span class="n">x</span> <span class="o">+</span> <span class="mi">1</span>
   <span class="n">To</span><span class="p">:</span>   <span class="n">Real</span> <span class="n">Field</span> <span class="k">with</span> <span class="mi">106</span> <span class="n">bits</span> <span class="n">of</span> <span class="n">precision</span>
   <span class="n">Defn</span><span class="p">:</span> <span class="n">a</span> <span class="o">|--&gt;</span> <span class="o">-</span><span class="mf">1.486472477019139559485881355066</span><span class="p">,</span>
 <span class="n">Ring</span> <span class="n">morphism</span><span class="p">:</span>
   <span class="n">From</span><span class="p">:</span> <span class="n">Number</span> <span class="n">Field</span> <span class="ow">in</span> <span class="n">a</span> <span class="k">with</span> <span class="n">defining</span> <span class="n">polynomial</span> <span class="n">x</span><span class="o">^</span><span class="mi">5</span> <span class="o">-</span> <span class="n">x</span><span class="o">^</span><span class="mi">3</span> <span class="o">-</span> <span class="mi">2</span><span class="o">*</span><span class="n">x</span> <span class="o">+</span> <span class="mi">1</span>
   <span class="n">To</span><span class="p">:</span>   <span class="n">Real</span> <span class="n">Field</span> <span class="k">with</span> <span class="mi">106</span> <span class="n">bits</span> <span class="n">of</span> <span class="n">precision</span>
   <span class="n">Defn</span><span class="p">:</span> <span class="n">a</span> <span class="o">|--&gt;</span> <span class="mf">0.4613519931561143817091321992793</span><span class="p">,</span>
 <span class="n">Ring</span> <span class="n">morphism</span><span class="p">:</span>
   <span class="n">From</span><span class="p">:</span> <span class="n">Number</span> <span class="n">Field</span> <span class="ow">in</span> <span class="n">a</span> <span class="k">with</span> <span class="n">defining</span> <span class="n">polynomial</span> <span class="n">x</span><span class="o">^</span><span class="mi">5</span> <span class="o">-</span> <span class="n">x</span><span class="o">^</span><span class="mi">3</span> <span class="o">-</span> <span class="mi">2</span><span class="o">*</span><span class="n">x</span> <span class="o">+</span> <span class="mi">1</span>
   <span class="n">To</span><span class="p">:</span>   <span class="n">Real</span> <span class="n">Field</span> <span class="k">with</span> <span class="mi">106</span> <span class="n">bits</span> <span class="n">of</span> <span class="n">precision</span>
   <span class="n">Defn</span><span class="p">:</span> <span class="n">a</span> <span class="o">|--&gt;</span> <span class="mf">1.311334219189466694020034823301</span><span class="p">,</span>
 <span class="n">Ring</span> <span class="n">morphism</span><span class="p">:</span>
   <span class="n">From</span><span class="p">:</span> <span class="n">Number</span> <span class="n">Field</span> <span class="ow">in</span> <span class="n">a</span> <span class="k">with</span> <span class="n">defining</span> <span class="n">polynomial</span> <span class="n">x</span><span class="o">^</span><span class="mi">5</span> <span class="o">-</span> <span class="n">x</span><span class="o">^</span><span class="mi">3</span> <span class="o">-</span> <span class="mi">2</span><span class="o">*</span><span class="n">x</span> <span class="o">+</span> <span class="mi">1</span>
   <span class="n">To</span><span class="p">:</span>   <span class="n">Complex</span> <span class="n">Field</span> <span class="k">with</span> <span class="mi">53</span> <span class="n">bits</span> <span class="n">of</span> <span class="n">precision</span>
   <span class="n">Defn</span><span class="p">:</span> <span class="n">a</span> <span class="o">|--&gt;</span> <span class="o">-</span><span class="mf">0.143106867663221</span> <span class="o">+</span> <span class="mf">1.04474941303801</span><span class="o">*</span><span class="n">I</span><span class="p">]</span>
</pre></div>
</div>
<p>Hence under the natural (diagonal) embedding <span class="math notranslate nohighlight">\(K \to \Bold{A}_K\)</span>, the generator
<code class="docutils literal notranslate"><span class="pre">a</span></code> of <span class="math notranslate nohighlight">\(K\)</span> maps to the following <span class="math notranslate nohighlight">\(K\)</span>-adèle:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: Ak(a)
(-1.486472477019140?, 0.4613519931561144?, 1.311334219189467?, -0.14310686766322076? + 1.0447494130380122?*I, a)
</pre></div>
</div>
<p>The above conversion defines a coercion and hence we can do:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: a + b
(-2.486472477019140?, 1.461351993156115?, 3.311334219189467?, -0.14310686766322076? + 5.0447494130380122?*I, 2*a mod (100/3))
sage: a * b
(1.486472477019140?, 0.4613519931561144?, 2.622668438378934?, -4.1789976521520487? - 0.57242747065288302?*I, a^2 mod (100/3*a))
</pre></div>
</div>
<div class="admonition seealso">
<p class="admonition-title">See also</p>
<p><a class="reference internal" href="profinite_number.html#module-adeles.profinite_number" title="adeles.profinite_number"><code class="xref py py-mod docutils literal notranslate"><span class="pre">profinite_number</span></code></a>,
<a class="reference internal" href="multiplicative_padic.html#module-adeles.multiplicative_padic" title="adeles.multiplicative_padic"><code class="xref py py-mod docutils literal notranslate"><span class="pre">multiplicative_padic</span></code></a>,
<a class="reference internal" href="idele.html#module-adeles.idele" title="adeles.idele"><code class="xref py py-mod docutils literal notranslate"><span class="pre">idele</span></code></a></p>
</div>
<p>REFERENCES:</p>
<p>[Her2021] Mathé Hertogh, Computing with adèles and idèles, master’s thesis,
Leiden University, 2021.</p>
<p>This implementation of adèles is based on [Her2021]. An extensive exposition of
properties, design choices and two applications can be found there.</p>
<p>AUTHORS:</p>
<ul class="simple">
<li><p>Mathé Hertogh (2021-07): initial version based on [Her2021]</p></li>
</ul>
<dl class="py class">
<dt id="adeles.adele.Adele">
<em class="property">class </em><code class="sig-prename descclassname">adeles.adele.</code><code class="sig-name descname">Adele</code><span class="sig-paren">(</span><em class="sig-param"><span class="n">parent</span></em>, <em class="sig-param"><span class="n">infinite</span></em>, <em class="sig-param"><span class="n">finite</span></em><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adele" title="Permalink to this definition">¶</a></dt>
<dd><p>Bases: <code class="xref py py-class docutils literal notranslate"><span class="pre">sage.structure.element.CommutativeAlgebraElement</span></code></p>
<p>Adèle over a Number Field</p>
<p>REFERENCES:</p>
<p>Section 3.4 of [Her2021].</p>
<dl class="py method">
<dt id="adeles.adele.Adele.__init__">
<code class="sig-name descname">__init__</code><span class="sig-paren">(</span><em class="sig-param"><span class="n">parent</span></em>, <em class="sig-param"><span class="n">infinite</span></em>, <em class="sig-param"><span class="n">finite</span></em><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adele.__init__" title="Permalink to this definition">¶</a></dt>
<dd><p>Construct the adèle determined by <code class="docutils literal notranslate"><span class="pre">infinite</span></code> and <code class="docutils literal notranslate"><span class="pre">finite</span></code></p>
<p>INPUT:</p>
<ul class="simple">
<li><p><code class="docutils literal notranslate"><span class="pre">parent</span></code> – an adèle ring of some number field <span class="math notranslate nohighlight">\(K\)</span></p></li>
<li><p><code class="docutils literal notranslate"><span class="pre">infinite</span></code> – a list of elements in real/complex interval fields;
denoting the signature of <span class="math notranslate nohighlight">\(K\)</span> by <span class="math notranslate nohighlight">\((r,s)\)</span>, the list must have length
<span class="math notranslate nohighlight">\(r+s\)</span>, the first <span class="math notranslate nohighlight">\(r\)</span> entries must be elements of <code class="docutils literal notranslate"><span class="pre">RealIntervalField</span></code>
and the last <span class="math notranslate nohighlight">\(s\)</span> entries must be elements of <code class="docutils literal notranslate"><span class="pre">ComplexIntervalField</span></code>.
If <span class="math notranslate nohighlight">\(K\)</span> has a unique infinite prime, then we also accept an element of
<code class="docutils literal notranslate"><span class="pre">RIF</span></code> or <code class="docutils literal notranslate"><span class="pre">CIF</span></code>, depending on whether the prime is real or complex.</p></li>
<li><p><code class="docutils literal notranslate"><span class="pre">finite</span></code> – a profinite number over <span class="math notranslate nohighlight">\(K\)</span></p></li>
</ul>
<p>OUTPUT:</p>
<p>An adèle with infinite part given by <code class="docutils literal notranslate"><span class="pre">infinite</span></code> and finite part given
by <code class="docutils literal notranslate"><span class="pre">finite</span></code>.</p>
<p>EXAMPLES:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: A = Adeles(QQ)
sage: Adele(A, 3.14, 7)
(3.1400000000000002?, 7)
sage: Qhat = ProfiniteNumbers(QQ)
sage: Adele(A, 7.9, Qhat(7/2, 9))
(7.9000000000000004?, 7/2 mod 9)
</pre></div>
</div>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">K</span><span class="o">.&lt;</span><span class="n">a</span><span class="o">&gt;</span> <span class="o">=</span> <span class="n">NumberField</span><span class="p">(</span><span class="n">x</span><span class="o">^</span><span class="mi">3</span><span class="o">+</span><span class="n">x</span><span class="o">+</span><span class="mi">1</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">Ak</span> <span class="o">=</span> <span class="n">Adeles</span><span class="p">(</span><span class="n">K</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">Khat</span> <span class="o">=</span> <span class="n">ProfiniteNumbers</span><span class="p">(</span><span class="n">K</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">Adele</span><span class="p">(</span><span class="n">Ak</span><span class="p">,</span> <span class="p">[</span><span class="o">-</span><span class="mi">1</span><span class="p">,</span> <span class="mi">1</span><span class="o">+</span><span class="n">I</span><span class="p">],</span> <span class="n">Khat</span><span class="p">(</span><span class="n">a</span><span class="o">/</span><span class="mi">3</span><span class="p">,</span> <span class="mi">100</span><span class="o">/</span><span class="mi">3</span><span class="p">))</span>
<span class="p">(</span><span class="o">-</span><span class="mi">1</span><span class="p">,</span> <span class="mi">1</span> <span class="o">+</span> <span class="mi">1</span><span class="o">*</span><span class="n">I</span><span class="p">,</span> <span class="mi">1</span><span class="o">/</span><span class="mi">3</span><span class="o">*</span><span class="n">a</span> <span class="n">mod</span> <span class="p">(</span><span class="mi">100</span><span class="o">/</span><span class="mi">3</span><span class="p">))</span>
</pre></div>
</div>
<p>TESTS:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">Adele</span><span class="p">(</span><span class="n">A</span><span class="p">,</span> <span class="p">[</span><span class="mf">3.0</span><span class="p">,</span> <span class="o">-</span><span class="mf">1.0</span><span class="p">],</span> <span class="mi">7</span><span class="p">)</span>
<span class="n">Traceback</span> <span class="p">(</span><span class="n">most</span> <span class="n">recent</span> <span class="n">call</span> <span class="n">last</span><span class="p">):</span>
<span class="o">...</span>
<span class="ne">TypeError</span><span class="p">:</span> <span class="n">infinite</span> <span class="n">should</span> <span class="n">have</span> <span class="n">length</span> <span class="mi">1</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">Adele</span><span class="p">(</span><span class="n">Ak</span><span class="p">,</span> <span class="mf">1.0</span><span class="p">,</span> <span class="mi">7</span><span class="p">)</span>
<span class="n">Traceback</span> <span class="p">(</span><span class="n">most</span> <span class="n">recent</span> <span class="n">call</span> <span class="n">last</span><span class="p">):</span>
<span class="o">...</span>
<span class="ne">TypeError</span><span class="p">:</span> <span class="n">infinite</span> <span class="n">must</span> <span class="n">be</span> <span class="n">a</span> <span class="nb">list</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">Adele</span><span class="p">(</span><span class="n">A</span><span class="p">,</span> <span class="p">[</span><span class="n">I</span><span class="p">],</span> <span class="mi">7</span><span class="p">)</span>
<span class="n">Traceback</span> <span class="p">(</span><span class="n">most</span> <span class="n">recent</span> <span class="n">call</span> <span class="n">last</span><span class="p">):</span>
<span class="o">...</span>
<span class="ne">TypeError</span><span class="p">:</span> <span class="mi">0</span><span class="n">th</span> <span class="n">infinite</span> <span class="n">value</span> <span class="p">(</span><span class="n">I</span><span class="p">)</span> <span class="n">should</span> <span class="n">lie</span> <span class="ow">in</span> <span class="n">Real</span> <span class="n">Interval</span> <span class="n">Field</span> <span class="k">with</span> <span class="mi">53</span> <span class="n">bits</span> <span class="n">of</span> <span class="n">precision</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">Adele</span><span class="p">(</span><span class="n">A</span><span class="p">,</span> <span class="p">[</span><span class="mf">1.0</span><span class="p">],</span> <span class="n">a</span><span class="o">+</span><span class="mi">1</span><span class="p">)</span>
<span class="n">Traceback</span> <span class="p">(</span><span class="n">most</span> <span class="n">recent</span> <span class="n">call</span> <span class="n">last</span><span class="p">):</span>
<span class="o">...</span>
<span class="ne">TypeError</span><span class="p">:</span> <span class="n">finite</span> <span class="n">should</span> <span class="n">lie</span> <span class="ow">in</span> <span class="n">Profinite</span> <span class="n">Numbers</span> <span class="n">of</span> <span class="n">Rational</span> <span class="n">Field</span>
</pre></div>
</div>
</dd></dl>

<dl class="py method">
<dt id="adeles.adele.Adele.__getitem__">
<code class="sig-name descname">__getitem__</code><span class="sig-paren">(</span><em class="sig-param"><span class="n">p</span></em><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adele.__getitem__" title="Permalink to this definition">¶</a></dt>
<dd><p>Return the projection of this adèle to the field of <code class="docutils literal notranslate"><span class="pre">p</span></code>-adic numbers</p>
<p>INPUT:</p>
<ul class="simple">
<li><p><code class="docutils literal notranslate"><span class="pre">p</span></code> – a prime number or <code class="docutils literal notranslate"><span class="pre">Infinity</span></code></p></li>
</ul>
<p>Only implemented for <span class="math notranslate nohighlight">\(\QQ\)</span>-adèles, as no general implementation of
completions at finite places of a number field exists in SageMath at the
time of writing.</p>
<p>View <span class="math notranslate nohighlight">\(\Bold{A}_\QQ\)</span> as <span class="math notranslate nohighlight">\(\RR \times \prod_p' \QQ_p\)</span> with <span class="math notranslate nohighlight">\(p\)</span> ranging
over all prime numbers and the restructed product taken with respect to
the open subrings <span class="math notranslate nohighlight">\(\ZZ_p\)</span>. This method implements the projections
<span class="math notranslate nohighlight">\(\Bold{A}_\QQ \to \RR\)</span> and <span class="math notranslate nohighlight">\(\Bold{A}_\QQ \to \QQ_p\)</span> for <span class="math notranslate nohighlight">\(p\)</span> a prime
number.</p>
<p>EXAMPLES:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: A = Adeles(QQ)
sage: a = A(1.23456789, Qhat(1/3, 2^5 * 3^10)); a
(1.2345678899999999?, 1/3 mod 1889568)
sage: a[oo]
1.2345678899999999?
sage: a[2]
1 + 2 + 2^3 + O(2^5)
sage: a[3]
3^-1 + O(3^10)
sage: a[5]
O(5^0)
</pre></div>
</div>
<p>REFERENCES:</p>
<p>Section 4.6 of [Her2021].</p>
</dd></dl>

<dl class="py method">
<dt id="adeles.adele.Adele._add_">
<code class="sig-name descname">_add_</code><span class="sig-paren">(</span><em class="sig-param"><span class="n">other</span></em><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adele._add_" title="Permalink to this definition">¶</a></dt>
<dd><p>Return the sum of this adèle and <code class="docutils literal notranslate"><span class="pre">other</span></code></p>
<p>EXAMPLES:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: A = Adeles(QQ)
sage: a = A(1.5, Qhat(-1/6, 2))
sage: b = A(2.5, Qhat(3/2, 12))
sage: a + b
(4, 4/3 mod 2)
sage: a + 1
(2.5000000000000000?, 5/6 mod 2)
</pre></div>
</div>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: K.&lt;zeta5&gt; = CyclotomicField(5)
sage: Ak = Adeles(K)
sage: Khat = ProfiniteNumbers(K)
sage: c = Ak([I, -I], Khat((1+zeta5+zeta5^2)/2, 100))
sage: d = Ak([3.5, I], Khat((zeta5^3+zeta5^4)/2, 200))
sage: c + d
(3.5000000000000000? + 1*I, 0, 0 mod (100))
</pre></div>
</div>
<p>REFERENCES:</p>
<p>Section Arithmetic in Section 3.4 of [Her2021].</p>
</dd></dl>

<dl class="py method">
<dt id="adeles.adele.Adele._sub_">
<code class="sig-name descname">_sub_</code><span class="sig-paren">(</span><em class="sig-param"><span class="n">other</span></em><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adele._sub_" title="Permalink to this definition">¶</a></dt>
<dd><p>Return the difference of this adèle and <code class="docutils literal notranslate"><span class="pre">other</span></code></p>
<p>EXAMPLES:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: A = Adeles(QQ)
sage: a = A(-10.375, Qhat(4/3, 5))
sage: b = A(5, Qhat(2/5, 5,))
sage: a - b
(-15.375000000000000?, 14/15 mod 5)
sage: b - a
(15.375000000000000?, 61/15 mod 5)
</pre></div>
</div>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: K.&lt;a&gt; = NumberField(x^2+3)
sage: Ak = Adeles(K)
sage: Khat = ProfiniteNumbers(K)
sage: b = Ak(I, Khat(a/4, 10*a))
sage: c = Ak(1, Khat(1/4, 30))
sage: b - c
(-1 + 1*I, 1/4*a - 1/4 mod (-10*a))
sage: c - c
(0, 0 mod (30))
sage: b - a
(-0.73205080756887720?*I, -3/4*a mod (-10*a))
</pre></div>
</div>
<p>REFERENCES:</p>
<p>Section Arithmetic in Section 3.4 of [Her2021].</p>
</dd></dl>

<dl class="py method">
<dt id="adeles.adele.Adele._mul_">
<code class="sig-name descname">_mul_</code><span class="sig-paren">(</span><em class="sig-param"><span class="n">other</span></em><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adele._mul_" title="Permalink to this definition">¶</a></dt>
<dd><p>Return the product of this adèle and <code class="docutils literal notranslate"><span class="pre">other</span></code></p>
<p>EXAMPLES:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">A</span> <span class="o">=</span> <span class="n">Adeles</span><span class="p">(</span><span class="n">QQ</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">a</span> <span class="o">=</span> <span class="n">A</span><span class="p">(</span><span class="o">-</span><span class="mi">1</span><span class="p">,</span> <span class="n">Qhat</span><span class="p">(</span><span class="mi">1</span><span class="o">/</span><span class="mi">5</span><span class="p">,</span> <span class="mi">80</span><span class="o">/</span><span class="mi">3</span><span class="p">))</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">b</span> <span class="o">=</span> <span class="n">A</span><span class="p">(</span><span class="mi">79</span><span class="p">,</span> <span class="n">Qhat</span><span class="p">(</span><span class="mi">1</span><span class="o">/</span><span class="mi">2</span><span class="p">,</span> <span class="mi">80</span><span class="p">))</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">a</span> <span class="o">*</span> <span class="n">b</span>
<span class="p">(</span><span class="o">-</span><span class="mi">79</span><span class="p">,</span> <span class="mi">1</span><span class="o">/</span><span class="mi">10</span> <span class="n">mod</span> <span class="mi">8</span><span class="o">/</span><span class="mi">3</span><span class="p">)</span>
</pre></div>
</div>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: K.&lt;a&gt; = NumberField(x^2+x+1)
sage: Ak = Adeles(K)
sage: Khat = ProfiniteNumbers(K)
sage: b = Ak(I, Khat(a, 10*a))
sage: c = Ak([CIF(2.3+I)], Khat(7*a+2, 30*a-3, a))
sage: b * b
(-1, -a - 1 mod (10))
sage: a * b
(-0.86602540378443860? - 0.50000000000000000?*I, -a - 1 mod (-10*a - 10))
</pre></div>
</div>
<p>REFERENCES:</p>
<p>Section Arithmetic in Section 3.4 of [Her2021].</p>
</dd></dl>

<dl class="py method">
<dt id="adeles.adele.Adele._div_">
<code class="sig-name descname">_div_</code><span class="sig-paren">(</span><em class="sig-param"><span class="n">other</span></em><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adele._div_" title="Permalink to this definition">¶</a></dt>
<dd><p>Return the quotient of this adèle by <code class="docutils literal notranslate"><span class="pre">other</span></code></p>
<p>EXAMPLES:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: A = Adeles(QQ)
sage: a = A([3.0], Qhat(6, 14))
sage: b = A([2.0], 3/2)
sage: a / b
(1.5000000000000000?, 4 mod 28/3)
</pre></div>
</div>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">K</span><span class="o">.&lt;</span><span class="n">a</span><span class="o">&gt;</span> <span class="o">=</span> <span class="n">NumberField</span><span class="p">(</span><span class="n">x</span><span class="o">^</span><span class="mi">4</span><span class="o">-</span><span class="mi">5</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">Ak</span> <span class="o">=</span> <span class="n">Adeles</span><span class="p">(</span><span class="n">K</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">Khat</span> <span class="o">=</span> <span class="n">ProfiniteNumbers</span><span class="p">(</span><span class="n">K</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">b</span> <span class="o">=</span> <span class="n">Ak</span><span class="p">([</span><span class="mi">5</span><span class="p">,</span> <span class="mi">5</span><span class="p">,</span> <span class="mi">5</span><span class="p">],</span> <span class="n">Khat</span><span class="p">(</span><span class="mi">5</span><span class="p">,</span> <span class="mi">1024</span><span class="o">/</span><span class="mi">9</span><span class="p">))</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">c</span> <span class="o">=</span> <span class="n">Ak</span><span class="p">([</span><span class="mi">5</span><span class="p">,</span> <span class="o">-</span><span class="mi">1</span><span class="p">,</span> <span class="n">I</span><span class="p">],</span> <span class="n">a</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">b</span> <span class="o">/</span> <span class="n">c</span>
<span class="p">(</span><span class="mi">1</span><span class="p">,</span> <span class="o">-</span><span class="mi">5</span><span class="p">,</span> <span class="o">-</span><span class="mi">5</span><span class="o">*</span><span class="n">I</span><span class="p">,</span> <span class="n">a</span><span class="o">^</span><span class="mi">3</span> <span class="n">mod</span> <span class="p">(</span><span class="mi">1024</span><span class="o">/</span><span class="mi">45</span><span class="o">*</span><span class="n">a</span><span class="o">^</span><span class="mi">3</span><span class="p">))</span>
</pre></div>
</div>
<div class="admonition note">
<p class="admonition-title">Note</p>
<p>One can only divide by adèles whose finite part has zero modulus and
non-zero value. If <code class="docutils literal notranslate"><span class="pre">other</span></code> does not satisfy this, an exception
is raised:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">c</span> <span class="o">/</span> <span class="n">b</span>
<span class="n">Traceback</span> <span class="p">(</span><span class="n">most</span> <span class="n">recent</span> <span class="n">call</span> <span class="n">last</span><span class="p">):</span>
<span class="o">...</span>
<span class="ne">ValueError</span><span class="p">:</span> <span class="n">division</span> <span class="n">by</span> <span class="n">profinite</span> <span class="n">number</span> <span class="k">with</span> <span class="n">non</span><span class="o">-</span><span class="n">zero</span> <span class="n">modulus</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">z</span> <span class="o">=</span> <span class="n">Ak</span><span class="p">([</span><span class="mi">1</span><span class="p">,</span> <span class="mi">1</span><span class="p">,</span> <span class="mi">1</span><span class="p">],</span> <span class="mi">0</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">b</span> <span class="o">/</span> <span class="n">z</span>
<span class="n">Traceback</span> <span class="p">(</span><span class="n">most</span> <span class="n">recent</span> <span class="n">call</span> <span class="n">last</span><span class="p">):</span>
<span class="o">...</span>
<span class="ne">ZeroDivisionError</span><span class="p">:</span> <span class="n">profinite</span> <span class="n">number</span> <span class="n">division</span> <span class="n">by</span> <span class="n">zero</span>
</pre></div>
</div>
</div>
<p>REFERENCES:</p>
<p>Section Arithmetic in Section 3.4 of [Her2021].</p>
</dd></dl>

<dl class="py method">
<dt id="adeles.adele.Adele._richcmp_">
<code class="sig-name descname">_richcmp_</code><span class="sig-paren">(</span><em class="sig-param"><span class="n">other</span></em>, <em class="sig-param"><span class="n">op</span></em><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adele._richcmp_" title="Permalink to this definition">¶</a></dt>
<dd><p>Compare this adèle with <code class="docutils literal notranslate"><span class="pre">other</span></code> based on the relation <code class="docutils literal notranslate"><span class="pre">op</span></code></p>
<p>We only implement equality and non-equality.</p>
<p>We declare two adèles equal if the <em>could</em> be equal, i.e. if their
represented subsets have non-empty intersection.</p>
<p>Inequality is defined as not being equal.</p>
<p>EXAMPLES:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">A</span> <span class="o">=</span> <span class="n">Adeles</span><span class="p">()</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">Qhat</span> <span class="o">=</span> <span class="n">ProfiniteNumbers</span><span class="p">(</span><span class="n">QQ</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">b</span> <span class="o">=</span> <span class="n">A</span><span class="p">([</span><span class="n">RIF</span><span class="p">(</span><span class="mf">2.0</span><span class="p">,</span> <span class="mf">3.0</span><span class="p">)],</span> <span class="n">Qhat</span><span class="p">(</span><span class="mi">3</span><span class="o">/</span><span class="mi">7</span><span class="p">,</span> <span class="mi">10</span><span class="o">/</span><span class="mi">7</span><span class="p">))</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">c</span> <span class="o">=</span> <span class="n">A</span><span class="p">([</span><span class="n">RIF</span><span class="p">(</span><span class="mf">2.5</span><span class="p">,</span> <span class="mf">3.5</span><span class="p">)],</span> <span class="n">Qhat</span><span class="p">(</span><span class="mi">13</span><span class="o">/</span><span class="mi">7</span><span class="p">,</span> <span class="mi">20</span><span class="o">/</span><span class="mi">7</span><span class="p">))</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">d</span> <span class="o">=</span> <span class="n">A</span><span class="p">([</span><span class="mf">2.1</span><span class="p">],</span> <span class="n">Qhat</span><span class="p">(</span><span class="mi">13</span><span class="o">/</span><span class="mi">7</span><span class="p">,</span> <span class="mi">20</span><span class="o">/</span><span class="mi">7</span><span class="p">))</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">e</span> <span class="o">=</span> <span class="n">A</span><span class="p">([</span><span class="mf">2.1</span><span class="p">],</span> <span class="n">Qhat</span><span class="p">(</span><span class="mi">3</span><span class="o">/</span><span class="mi">7</span><span class="p">,</span> <span class="mi">20</span><span class="o">/</span><span class="mi">7</span><span class="p">))</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">b</span> <span class="o">==</span> <span class="n">c</span>
<span class="kc">True</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">b</span> <span class="o">==</span> <span class="n">d</span>
<span class="kc">True</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">c</span> <span class="o">==</span> <span class="n">d</span>
<span class="kc">False</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">b</span> <span class="o">!=</span> <span class="n">e</span>
<span class="kc">False</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">d</span> <span class="o">==</span> <span class="n">e</span>
<span class="kc">False</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">c</span> <span class="o">!=</span> <span class="n">d</span>
<span class="kc">True</span>
</pre></div>
</div>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">K</span><span class="o">.&lt;</span><span class="n">i</span><span class="o">&gt;</span> <span class="o">=</span> <span class="n">NumberField</span><span class="p">(</span><span class="n">x</span><span class="o">^</span><span class="mi">2</span><span class="o">+</span><span class="mi">1</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">Ak</span> <span class="o">=</span> <span class="n">Adeles</span><span class="p">(</span><span class="n">K</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">Khat</span> <span class="o">=</span> <span class="n">ProfiniteNumbers</span><span class="p">(</span><span class="n">K</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">b</span> <span class="o">=</span> <span class="n">Ak</span><span class="p">([</span><span class="n">I</span><span class="p">],</span> <span class="n">Khat</span><span class="p">(</span><span class="n">i</span><span class="o">/</span><span class="mi">3</span><span class="p">,</span> <span class="p">(</span><span class="mi">10</span><span class="o">+</span><span class="n">i</span><span class="p">)</span><span class="o">/</span><span class="mi">3</span><span class="p">))</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">c</span> <span class="o">=</span> <span class="n">Ak</span><span class="p">([</span><span class="n">RIF</span><span class="p">(</span><span class="o">-</span><span class="mi">1</span><span class="p">,</span> <span class="mi">4</span><span class="p">)</span><span class="o">*</span><span class="n">I</span><span class="p">],</span> <span class="n">Khat</span><span class="p">(</span><span class="o">-</span><span class="mi">10</span><span class="o">/</span><span class="mi">3</span><span class="p">,</span> <span class="mi">2</span><span class="o">/</span><span class="mi">3</span><span class="o">*</span><span class="p">(</span><span class="mi">10</span><span class="o">+</span><span class="n">i</span><span class="p">)))</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">b</span> <span class="o">==</span> <span class="n">c</span>
<span class="kc">True</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">b</span> <span class="o">!=</span> <span class="n">c</span>
<span class="kc">False</span>
</pre></div>
</div>
<p>REFERENCES:</p>
<p>Section 5.4 of [Her2021].</p>
<p>TESTS:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">b</span> <span class="o">&lt;</span> <span class="n">c</span>
<span class="n">Traceback</span> <span class="p">(</span><span class="n">most</span> <span class="n">recent</span> <span class="n">call</span> <span class="n">last</span><span class="p">):</span>
<span class="o">...</span>
<span class="ne">NotImplementedError</span><span class="p">:</span> <span class="n">only</span> <span class="n">equality</span> <span class="ow">and</span> <span class="n">inequality</span> <span class="n">are</span> <span class="n">implemented</span>
</pre></div>
</div>
</dd></dl>

<dl class="py method">
<dt id="adeles.adele.Adele.finite_part">
<code class="sig-name descname">finite_part</code><span class="sig-paren">(</span><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adele.finite_part" title="Permalink to this definition">¶</a></dt>
<dd><p>Return the finite part of this adèle</p>
<p>EXAMPLES:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">A</span> <span class="o">=</span> <span class="n">Adeles</span><span class="p">(</span><span class="n">QQ</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">a</span> <span class="o">=</span> <span class="n">A</span><span class="p">(</span><span class="mf">2.0</span><span class="p">,</span> <span class="n">Qhat</span><span class="p">(</span><span class="mi">17</span><span class="o">/</span><span class="mi">2</span><span class="p">,</span> <span class="mi">1000</span><span class="o">/</span><span class="mi">3</span><span class="p">))</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">a</span><span class="o">.</span><span class="n">finite_part</span><span class="p">()</span>
<span class="mi">17</span><span class="o">/</span><span class="mi">2</span> <span class="n">mod</span> <span class="mi">1000</span><span class="o">/</span><span class="mi">3</span>
</pre></div>
</div>
</dd></dl>

<dl class="py method">
<dt id="adeles.adele.Adele.infinite_part">
<code class="sig-name descname">infinite_part</code><span class="sig-paren">(</span><em class="sig-param"><span class="n">index</span><span class="o">=</span><span class="default_value">None</span></em><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adele.infinite_part" title="Permalink to this definition">¶</a></dt>
<dd><p>Return the infinite part of this adèle as a list, or a single entry</p>
<p>INPUT:</p>
<ul class="simple">
<li><p><code class="docutils literal notranslate"><span class="pre">index</span></code> – non-negative integer smaller than the length of our
infinite part (optional); if specified, return the <code class="docutils literal notranslate"><span class="pre">index</span></code>-th entry
of our infinite part</p></li>
</ul>
<p>OUTPUT:</p>
<p>Return the infinite part of this adèle, or the <code class="docutils literal notranslate"><span class="pre">index</span></code>-th entry if
<code class="docutils literal notranslate"><span class="pre">index</span></code> is specified.</p>
<p>EXAMPLES:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: K.&lt;a&gt; = NumberField(x^5 + 10)
sage: A = Adeles(K)
sage: a = A([1.6, I, -I], 0)
sage: a.infinite_part()
[1.6000000000000001?, 1*I, -1*I]
sage: a.infinite_part(0)
1.6000000000000001?
sage: a.infinite_part(2)
-1*I
</pre></div>
</div>
</dd></dl>

<dl class="py method">
<dt id="adeles.adele.Adele.to_rational_vector">
<code class="sig-name descname">to_rational_vector</code><span class="sig-paren">(</span><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adele.to_rational_vector" title="Permalink to this definition">¶</a></dt>
<dd><p>Convert this adèle to a vector of <span class="math notranslate nohighlight">\(\QQ\)</span>-adèles</p>
<p>Let <span class="math notranslate nohighlight">\(K\)</span> be our base number field, <span class="math notranslate nohighlight">\(\alpha\)</span> its generator over <span class="math notranslate nohighlight">\(\QQ\)</span> and
<span class="math notranslate nohighlight">\(n\)</span> its degree over <span class="math notranslate nohighlight">\(\QQ\)</span>. Then every <span class="math notranslate nohighlight">\(x \in \Bold{A}_K\)</span> can be written
uniquely as <span class="math notranslate nohighlight">\(x = \sum_{i=0}^{n-1} x_i \alpha^i\)</span> with
<span class="math notranslate nohighlight">\(x_i \in \Bold{A}_\QQ\)</span>. This induces a map
<span class="math notranslate nohighlight">\(\phi: \Bold{A}_K \to \Bold{A}_\QQ^n\)</span>.</p>
<p>This method implements <span class="math notranslate nohighlight">\(\phi\)</span>.</p>
<p>OUTPUT:</p>
<p>A vector <span class="math notranslate nohighlight">\((x_0, ..., x_{n-1})\)</span> of <span class="math notranslate nohighlight">\(\QQ\)</span>-adèles such that the following
holds. Let <span class="math notranslate nohighlight">\(i \in \{0, ..., n-1\}\)</span> and let
<span class="math notranslate nohighlight">\(\phi_i: \Bold{A}_K \to \Bold{A}_\QQ\)</span> be the composition of <span class="math notranslate nohighlight">\(\phi\)</span>
with the projection to the <span class="math notranslate nohighlight">\(i\)</span>-th <span class="math notranslate nohighlight">\(\Bold{A}_\QQ\)</span>. Then for any
<span class="math notranslate nohighlight">\(\alpha\)</span> that <code class="docutils literal notranslate"><span class="pre">self</span></code> represents, <span class="math notranslate nohighlight">\(\phi_i(\alpha)\)</span> is represented by
<span class="math notranslate nohighlight">\(x_i\)</span>.</p>
<p>EXAMPLES:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: K.&lt;a&gt; = NumberField(x^3-2)
sage: AK = Adeles(K)
sage: b = AK([-7, 2+I], 1+2*a+3*a^2)
sage: c = b.to_rational_vector(); c
((-1.00000000000000?, 1), (-1.92285836561943?, 2), (-2.25358945349955?, 3))
</pre></div>
</div>
<p>Let us check that these infinite parts are correct:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: x = [ci[oo] for ci in c]; x
[-1.00000000000000?, -1.92285836561943?, -2.25358945349955?]
sage: emb = infinite_completions(K, embeddings_only=True)
sage: x[0] + x[1]*emb[0](a) + x[2]*emb[0](a^2)
-7.0000000000000?
sage: x[0] + x[1]*emb[1](a) + x[2]*emb[1](a^2)
2.0000000000000? + 1.00000000000000?*I
</pre></div>
</div>
<div class="admonition seealso">
<p class="admonition-title">See also</p>
<p><a class="reference internal" href="profinite_number.html#adeles.profinite_number.ProfiniteNumber.to_rational_vector" title="adeles.profinite_number.ProfiniteNumber.to_rational_vector"><code class="xref py py-meth docutils literal notranslate"><span class="pre">to_rational_vector()</span></code></a></p>
</div>
<p>REFERENCES:</p>
<p>Section 4.4 of [Her2021].</p>
</dd></dl>

</dd></dl>

<dl class="py class">
<dt id="adeles.adele.Adeles">
<em class="property">class </em><code class="sig-prename descclassname">adeles.adele.</code><code class="sig-name descname">Adeles</code><span class="sig-paren">(</span><em class="sig-param"><span class="n">K</span></em><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adeles" title="Permalink to this definition">¶</a></dt>
<dd><p>Bases: <code class="xref py py-class docutils literal notranslate"><span class="pre">sage.structure.unique_representation.UniqueRepresentation</span></code>, <code class="xref py py-class docutils literal notranslate"><span class="pre">sage.rings.ring.CommutativeAlgebra</span></code></p>
<p>Adèle Ring of a Number Field</p>
<p>REFERENCES:</p>
<p>Section 3.4 of [Her2021].</p>
<dl class="py method">
<dt id="adeles.adele.Adeles._element_constructor_">
<code class="sig-name descname">_element_constructor_</code><span class="sig-paren">(</span><em class="sig-param"><span class="n">x</span></em>, <em class="sig-param"><span class="n">y</span><span class="o">=</span><span class="default_value">None</span></em><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adeles._element_constructor_" title="Permalink to this definition">¶</a></dt>
<dd><p>Construct an adèle</p>
<p>INPUT:</p>
<p>We accept many input formats. Denote our base number field by <span class="math notranslate nohighlight">\(K\)</span> and
its signature by <span class="math notranslate nohighlight">\((r,s)\)</span>.</p>
<p>The standard format is a pair <span class="math notranslate nohighlight">\((x,y)\)</span> where <span class="math notranslate nohighlight">\(x\)</span> specifies the infinite
part and <span class="math notranslate nohighlight">\(y\)</span> specifies the finite part. Here <span class="math notranslate nohighlight">\(x\)</span> should be a list of
length <span class="math notranslate nohighlight">\(r+s\)</span> with the first <span class="math notranslate nohighlight">\(r\)</span> entries in <code class="docutils literal notranslate"><span class="pre">RIF</span></code> and the last <span class="math notranslate nohighlight">\(s\)</span>
entries in <code class="docutils literal notranslate"><span class="pre">CIF</span></code>. And <span class="math notranslate nohighlight">\(y\)</span> should be a profinite <span class="math notranslate nohighlight">\(K\)</span>-number.</p>
<p>The other formats accept only one argument and they can be one of the
following.</p>
<ul class="simple">
<li><p>a <span class="math notranslate nohighlight">\(K\)</span>-adèle; construct a copy</p></li>
<li><p>an element <span class="math notranslate nohighlight">\(x\)</span> of <span class="math notranslate nohighlight">\(K\)</span>; construct the (diagonal) image of <span class="math notranslate nohighlight">\(x\)</span> in this
adèle ring</p></li>
<li><p>a profinite <span class="math notranslate nohighlight">\(K\)</span>-integer; specifies the finite part only</p></li>
<li><p>a <span class="math notranslate nohighlight">\(K\)</span>-idèle; convert the idèle to an adèle (see <a class="reference internal" href="#adeles.adele.Adeles._from_idele" title="adeles.adele.Adeles._from_idele"><code class="xref py py-meth docutils literal notranslate"><span class="pre">_from_idele()</span></code></a>)</p></li>
</ul>
<p>If <span class="math notranslate nohighlight">\(K\)</span> is <span class="math notranslate nohighlight">\(\QQ\)</span>, we also accept a list consisting of <span class="math notranslate nohighlight">\(p\)</span>-adic numbers,
for distinct prime numbers <span class="math notranslate nohighlight">\(p\)</span>, as well as at most one real number.
See <a class="reference internal" href="#adeles.adele.Adeles._from_padics" title="adeles.adele.Adeles._from_padics"><code class="xref py py-meth docutils literal notranslate"><span class="pre">_from_padics()</span></code></a> for details.</p>
<p>EXAMPLES:</p>
<p>We start with the standard format:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: K.&lt;a&gt; = NumberField(x^3-7)
sage: Ak = Adeles(K)
sage: Khat = ProfiniteNumbers(K)
sage: b = Ak([3.14, -I], Khat(a+1/5, 9*a^2)); b
(3.1400000000000002?, -1*I, (a mod (9*a^2))/(a + 1))
</pre></div>
</div>
<p>Let’s make a copy of <code class="docutils literal notranslate"><span class="pre">b</span></code>:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: c = Ak(b); c
(3.1400000000000002?, -1*I, (a mod (9*a^2))/(a + 1))
</pre></div>
</div>
<p>We create the adèle corresponding to <span class="math notranslate nohighlight">\(a/2\)</span>:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: Ak(a/2)
(0.9564655913861945?, -0.47823279569309730? + 0.82832349998615107?*I, 1/2*a)
</pre></div>
</div>
<p>Upon given a profinite <code class="docutils literal notranslate"><span class="pre">K</span></code>-number, the values at the infinite primes
are completely unknonwn:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">Ak</span><span class="p">(</span><span class="n">Khat</span><span class="p">(</span><span class="mi">1</span><span class="o">/</span><span class="mi">10</span><span class="p">,</span> <span class="mi">100</span><span class="o">*</span><span class="n">a</span><span class="o">^</span><span class="mi">2</span><span class="p">))</span>
<span class="p">(</span><span class="n">RR</span><span class="p">,</span> <span class="n">CC</span><span class="p">,</span> <span class="mi">1</span><span class="o">/</span><span class="mi">10</span> <span class="n">mod</span> <span class="p">(</span><span class="mi">100</span><span class="o">*</span><span class="n">a</span><span class="o">^</span><span class="mi">2</span><span class="p">))</span>
</pre></div>
</div>
<p>We can also convert an idèle to an adèle:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">J</span> <span class="o">=</span> <span class="n">Ideles</span><span class="p">(</span><span class="n">K</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">u</span> <span class="o">=</span> <span class="n">J</span><span class="p">([</span><span class="o">-</span><span class="mi">1</span><span class="p">,</span> <span class="n">I</span><span class="p">],</span> <span class="p">{</span><span class="n">a</span><span class="p">:</span> <span class="p">(</span><span class="n">a</span><span class="p">,</span> <span class="mi">6</span><span class="p">)});</span> <span class="n">u</span>
<span class="n">Idele</span> <span class="k">with</span> <span class="n">values</span><span class="p">:</span>
  <span class="n">infinity_0</span><span class="p">:</span>   <span class="o">-</span><span class="mi">1</span>
  <span class="n">infinity_1</span><span class="p">:</span>   <span class="mi">1</span><span class="o">*</span><span class="n">I</span>
  <span class="p">(</span><span class="mi">7</span><span class="p">,</span> <span class="n">a</span><span class="p">):</span>       <span class="n">a</span> <span class="o">*</span> <span class="n">U</span><span class="p">(</span><span class="mi">6</span><span class="p">)</span>
  <span class="n">other</span> <span class="n">primes</span><span class="p">:</span> <span class="mi">1</span> <span class="o">*</span> <span class="n">U</span><span class="p">(</span><span class="mi">0</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">Ak</span><span class="p">(</span><span class="n">u</span><span class="p">)</span>
<span class="p">(</span><span class="o">-</span><span class="mi">1</span><span class="p">,</span> <span class="mi">1</span><span class="o">*</span><span class="n">I</span><span class="p">,</span> <span class="n">a</span> <span class="n">mod</span> <span class="p">(</span><span class="mi">686</span><span class="p">,</span> <span class="mi">49</span><span class="o">*</span><span class="n">a</span> <span class="o">+</span> <span class="mi">343</span><span class="p">,</span> <span class="mi">49</span><span class="o">*</span><span class="n">a</span><span class="o">^</span><span class="mi">2</span> <span class="o">+</span> <span class="mi">343</span><span class="p">))</span>
</pre></div>
</div>
<p>Lastly we demonstrate the construction of a <span class="math notranslate nohighlight">\(\QQ\)</span>-adèle using <span class="math notranslate nohighlight">\(p\)</span>-adic
numbers:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: A = Adeles(QQ)
sage: a_2 = Qp(2)(5/2, 2); a_2
2^-1 + 2 + O(2^2)
sage: a_3 = Qp(3)(7/27, -1); a_3
3^-3 + 2*3^-2 + O(3^-1)
sage: a = A([-7.25, a_2, a_3]); a
(-7.2500000000000000?, 23/54 mod 4/3)
sage: a[2]
2^-1 + 2 + O(2^2)
sage: a[3]
3^-3 + 2*3^-2 + O(3^-1)
</pre></div>
</div>
<dl class="py method">
<dt id="adeles.adele.Adeles._from_padics">
<code class="sig-name descname">_from_padics</code><span class="sig-paren">(</span><em class="sig-param"><span class="n">padics</span></em><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adeles._from_padics" title="Permalink to this definition">¶</a></dt>
<dd><p>Construct an adèle over <span class="math notranslate nohighlight">\(\QQ\)</span> from the list of <span class="math notranslate nohighlight">\(p\)</span>-adic numbers
<code class="docutils literal notranslate"><span class="pre">padics</span></code></p>
<p>Only implemented over <span class="math notranslate nohighlight">\(\QQ\)</span>, as no general implementation of <span class="math notranslate nohighlight">\(p\)</span>-adic
numbers currently exists for general number fields.</p>
<p>INPUT:</p>
<ul class="simple">
<li><p><code class="docutils literal notranslate"><span class="pre">padics</span></code> – a list consisting of <span class="math notranslate nohighlight">\(p\)</span>-adic numbers, for distinct
prime numbers <span class="math notranslate nohighlight">\(p\)</span>, as well as at most one real number</p></li>
</ul>
<p>OUTPUT:</p>
<p>The <span class="math notranslate nohighlight">\(\QQ\)</span>-adèle with infinite part equal to the real number in the list,
if it exists, or <span class="math notranslate nohighlight">\(\RR\)</span> otherwise, and with finite part given by
<a class="reference internal" href="profinite_number.html#adeles.profinite_number.ProfiniteNumbers._from_padic_numbers" title="adeles.profinite_number.ProfiniteNumbers._from_padic_numbers"><code class="xref py py-meth docutils literal notranslate"><span class="pre">_from_padic_numbers()</span></code></a>,
to which we give as input <code class="docutils literal notranslate"><span class="pre">padics</span></code> with the optional real number
removed.</p>
<p>EXAMPLES:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: A = Adeles()
sage: a_2 = Qp(2)(6, 3); a_2
2 + 2^2 + O(2^3)
sage: a_5 = Qp(5)(2/5, 1); a_5
2*5^-1 + O(5)
sage: a = A._from_padics([9.7, a_2, a_5]); a
(9.6999999999999993?, 102/5 mod 40)
sage: a[2]
2 + 2^2 + O(2^3)
sage: a[3]
O(3^0)
sage: a[5]
2*5^-1 + O(5)
sage: a[oo]
9.6999999999999993?
</pre></div>
</div>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">b_3</span> <span class="o">=</span> <span class="n">Qp</span><span class="p">(</span><span class="mi">3</span><span class="p">)(</span><span class="mi">0</span><span class="p">,</span> <span class="mi">2</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">b_7</span> <span class="o">=</span> <span class="n">Qp</span><span class="p">(</span><span class="mi">7</span><span class="p">)(</span><span class="mi">1</span><span class="o">/</span><span class="p">(</span><span class="mi">2</span><span class="o">*</span><span class="mi">49</span><span class="p">),</span> <span class="o">-</span><span class="mi">1</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">b</span> <span class="o">=</span> <span class="n">A</span><span class="o">.</span><span class="n">_from_padics</span><span class="p">([</span><span class="n">b_7</span><span class="p">,</span> <span class="n">b_3</span><span class="p">]);</span> <span class="n">b</span>
<span class="p">(</span><span class="n">RR</span><span class="p">,</span> <span class="mi">18</span><span class="o">/</span><span class="mi">49</span> <span class="n">mod</span> <span class="mi">9</span><span class="o">/</span><span class="mi">7</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">b</span><span class="p">[</span><span class="mi">3</span><span class="p">]</span> <span class="o">==</span> <span class="n">b_3</span> <span class="ow">and</span> <span class="n">b</span><span class="p">[</span><span class="mi">7</span><span class="p">]</span> <span class="o">==</span> <span class="n">b_7</span>
<span class="kc">True</span>
</pre></div>
</div>
<p>REFERENCES:</p>
<p>Section 4.6 of [Her2021].</p>
</dd></dl>

<dl class="py method">
<dt id="adeles.adele.Adeles._from_idele">
<code class="sig-name descname">_from_idele</code><span class="sig-paren">(</span><em class="sig-param"><span class="n">idele</span></em><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adeles._from_idele" title="Permalink to this definition">¶</a></dt>
<dd><p>Construct the adèle corresponding to the idèle <code class="docutils literal notranslate"><span class="pre">idele</span></code></p>
<p>This implements the inclusion of the idèles into the adèles. Due to the
different ways of storing adèles and idèles, this may lose precision:
the represented subset of the returned <code class="docutils literal notranslate"><span class="pre">Adele</span></code> will contain the
represented subset of <code class="docutils literal notranslate"><span class="pre">idèle</span></code> and it might be bigger.</p>
<p>EXAMPLES:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: A = Adeles(QQ)
sage: from idele import Ideles
sage: J = Ideles(QQ)
sage: u = J(6, {2: (1, 1), 3: (1/3, 0)})
sage: A(u)
(6, 1/3 mod 2/3)
sage: v = J(7.9, {3: (2, 2), 5: (1, 1)})
sage: A(v)
(7.9000000000000004?, 11 mod 90)
</pre></div>
</div>
<p>Note the factor <span class="math notranslate nohighlight">\(2\)</span> in te modulus of the finite part in this last
example. This is because <code class="docutils literal notranslate"><span class="pre">v[2]</span></code> is <code class="docutils literal notranslate"><span class="pre">1</span> <span class="pre">*</span> <span class="pre">U(0)</span></code>, which has represented
subset <span class="math notranslate nohighlight">\(\ZZ_2^*\)</span>, which equals <span class="math notranslate nohighlight">\(1 + 2\ZZ_2\)</span>. Hence we know that the
finite part of <code class="docutils literal notranslate"><span class="pre">A(v)</span></code> is <code class="docutils literal notranslate"><span class="pre">1</span></code> moduluo <code class="docutils literal notranslate"><span class="pre">2</span></code>, even though no explicit
value is stored for <code class="docutils literal notranslate"><span class="pre">v</span></code> at <code class="docutils literal notranslate"><span class="pre">2</span></code>.</p>
<p>A similar thing happens in the following example over a non-trivial
number field:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">K</span><span class="o">.&lt;</span><span class="n">a</span><span class="o">&gt;</span> <span class="o">=</span> <span class="n">NumberField</span><span class="p">(</span><span class="n">x</span><span class="o">^</span><span class="mi">2</span><span class="o">+</span><span class="mi">5</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">Ak</span> <span class="o">=</span> <span class="n">Adeles</span><span class="p">(</span><span class="n">K</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">Jk</span> <span class="o">=</span> <span class="n">Ideles</span><span class="p">(</span><span class="n">K</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">u</span> <span class="o">=</span> <span class="n">Jk</span><span class="p">([</span><span class="n">I</span><span class="p">],</span> <span class="p">{})</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">Ak</span><span class="p">(</span><span class="n">u</span><span class="p">)</span>
<span class="p">(</span><span class="mi">1</span><span class="o">*</span><span class="n">I</span><span class="p">,</span> <span class="n">a</span> <span class="n">mod</span> <span class="p">(</span><span class="mi">2</span><span class="p">,</span> <span class="n">a</span> <span class="o">+</span> <span class="mi">1</span><span class="p">))</span>
</pre></div>
</div>
<p>Now a more complicated example:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">p2</span><span class="p">,</span> <span class="n">p3</span> <span class="o">=</span> <span class="n">K</span><span class="o">.</span><span class="n">prime_above</span><span class="p">(</span><span class="mi">2</span><span class="p">),</span> <span class="n">K</span><span class="o">.</span><span class="n">prime_above</span><span class="p">(</span><span class="mi">3</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">v</span> <span class="o">=</span> <span class="n">Jk</span><span class="p">([</span><span class="mi">1</span><span class="o">+</span><span class="n">I</span><span class="p">],</span> <span class="p">{</span><span class="n">p2</span><span class="p">:</span> <span class="p">(</span><span class="n">a</span><span class="p">,</span> <span class="mi">3</span><span class="p">),</span> <span class="n">p3</span><span class="p">:</span> <span class="p">(</span><span class="mi">1</span><span class="o">/</span><span class="mi">3</span><span class="o">-</span><span class="n">a</span><span class="p">,</span> <span class="mi">3</span><span class="p">)})</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">Ak</span><span class="p">(</span><span class="n">v</span><span class="p">)</span>
<span class="p">(</span><span class="mi">1</span> <span class="o">+</span> <span class="mi">1</span><span class="o">*</span><span class="n">I</span><span class="p">,</span> <span class="mi">1</span><span class="o">/</span><span class="mi">3</span><span class="o">*</span><span class="n">a</span> <span class="o">+</span> <span class="mi">2</span><span class="o">/</span><span class="mi">3</span> <span class="n">mod</span> <span class="p">(</span><span class="mi">36</span><span class="p">,</span> <span class="mi">2</span><span class="o">*</span><span class="n">a</span> <span class="o">+</span> <span class="mi">14</span><span class="p">))</span>
</pre></div>
</div>
<p>This conversion defines a coercion:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: a = A([2.5], Qhat(1/5, 10))
sage: u = J([-0.5], {2: (1/2, 2), 5: (1, 1)})
sage: a + u
(2, 87/10 mod 10)
sage: u - a
(-3, 83/10 mod 10)
sage: a * u
(-1.2500000000000000?, 7/10 mod 1)
</pre></div>
</div>
<p>REFERENCES:</p>
<p>Section 4.3 of [Her2021].</p>
</dd></dl>

</dd></dl>

<dl class="py attribute">
<dt id="adeles.adele.Adeles.Element">
<code class="sig-name descname">Element</code><a class="headerlink" href="#adeles.adele.Adeles.Element" title="Permalink to this definition">¶</a></dt>
<dd><p>alias of <a class="reference internal" href="#adeles.adele.Adele" title="adeles.adele.Adele"><code class="xref py py-class docutils literal notranslate"><span class="pre">Adele</span></code></a></p>
</dd></dl>

<dl class="py method">
<dt id="adeles.adele.Adeles.characteristic">
<code class="sig-name descname">characteristic</code><span class="sig-paren">(</span><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adeles.characteristic" title="Permalink to this definition">¶</a></dt>
<dd><p>Return the characteristic of this ring, which is zero</p>
<p>EXAMPLES:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">Adeles</span><span class="p">()</span><span class="o">.</span><span class="n">characteristic</span><span class="p">()</span>
<span class="mi">0</span>
</pre></div>
</div>
</dd></dl>

<dl class="py method">
<dt id="adeles.adele.Adeles.construction">
<code class="sig-name descname">construction</code><span class="sig-paren">(</span><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adeles.construction" title="Permalink to this definition">¶</a></dt>
<dd><p>Return a pair <code class="docutils literal notranslate"><span class="pre">(functor,</span> <span class="pre">parent)</span></code> such that <code class="docutils literal notranslate"><span class="pre">functor(parent)</span></code>
returns this adèle ring.</p>
<p>EXAMPLES:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">A</span><span class="p">,</span> <span class="n">Q</span> <span class="o">=</span> <span class="n">Adeles</span><span class="p">()</span><span class="o">.</span><span class="n">construction</span><span class="p">();</span> <span class="n">A</span><span class="p">,</span> <span class="n">Q</span>
<span class="p">(</span><span class="n">AdelizationFunctor</span><span class="p">,</span> <span class="n">Rational</span> <span class="n">Field</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">A</span><span class="p">(</span><span class="n">Q</span><span class="p">)</span> <span class="ow">is</span> <span class="n">Adeles</span><span class="p">()</span>
<span class="kc">True</span>
</pre></div>
</div>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">K</span><span class="o">.&lt;</span><span class="n">a</span><span class="o">&gt;</span> <span class="o">=</span> <span class="n">NumberField</span><span class="p">(</span><span class="n">x</span><span class="o">^</span><span class="mi">5</span><span class="o">-</span><span class="mi">2</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">A</span><span class="p">,</span> <span class="n">K</span> <span class="o">=</span> <span class="n">Adeles</span><span class="p">(</span><span class="n">K</span><span class="p">)</span><span class="o">.</span><span class="n">construction</span><span class="p">();</span> <span class="n">A</span><span class="p">,</span> <span class="n">K</span>
<span class="p">(</span><span class="n">AdelizationFunctor</span><span class="p">,</span> <span class="n">Number</span> <span class="n">Field</span> <span class="ow">in</span> <span class="n">a</span> <span class="k">with</span> <span class="n">defining</span> <span class="n">polynomial</span> <span class="n">x</span><span class="o">^</span><span class="mi">5</span> <span class="o">-</span> <span class="mi">2</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">A</span><span class="p">(</span><span class="n">K</span><span class="p">)</span> <span class="ow">is</span> <span class="n">Adeles</span><span class="p">(</span><span class="n">K</span><span class="p">)</span>
<span class="kc">True</span>
</pre></div>
</div>
</dd></dl>

<dl class="py method">
<dt id="adeles.adele.Adeles.epsilon">
<code class="sig-name descname">epsilon</code><span class="sig-paren">(</span><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adeles.epsilon" title="Permalink to this definition">¶</a></dt>
<dd><p>Return the precision error of elements in this ring</p>
<p>As this depends on the elements, we can give no reasonable answer and
hence raise a <code class="docutils literal notranslate"><span class="pre">NotImplementedError</span></code>.</p>
<p>EXAMPLES:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">Adeles</span><span class="p">()</span><span class="o">.</span><span class="n">epsilon</span><span class="p">()</span>
<span class="n">Traceback</span> <span class="p">(</span><span class="n">most</span> <span class="n">recent</span> <span class="n">call</span> <span class="n">last</span><span class="p">):</span>
<span class="o">...</span>
<span class="ne">NotImplementedError</span><span class="p">:</span> <span class="n">precision</span> <span class="n">error</span> <span class="n">depends</span> <span class="n">on</span> <span class="n">the</span> <span class="n">elements</span> <span class="n">involved</span>
</pre></div>
</div>
</dd></dl>

<dl class="py method">
<dt id="adeles.adele.Adeles.gen">
<code class="sig-name descname">gen</code><span class="sig-paren">(</span><em class="sig-param"><span class="n">n</span><span class="o">=</span><span class="default_value">0</span></em><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adeles.gen" title="Permalink to this definition">¶</a></dt>
<dd><p>Return the <code class="docutils literal notranslate"><span class="pre">n</span></code>-th generator of this ring</p>
<p>As this ring has only one generator, we only accept <code class="docutils literal notranslate"><span class="pre">n</span> <span class="pre">==</span> <span class="pre">0</span></code>.</p>
<p>INPUT:</p>
<ul class="simple">
<li><p><code class="docutils literal notranslate"><span class="pre">n</span></code> – the index of the generator to return (default: <code class="docutils literal notranslate"><span class="pre">0</span></code>); must
be zero</p></li>
</ul>
<p>EXAMPLES:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">Adeles</span><span class="p">(</span><span class="n">CyclotomicField</span><span class="p">(</span><span class="mi">5</span><span class="p">))</span><span class="o">.</span><span class="n">gen</span><span class="p">()</span>
<span class="p">(</span><span class="mi">1</span><span class="p">,</span> <span class="mi">1</span><span class="p">,</span> <span class="mi">1</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">Adeles</span><span class="p">()</span><span class="o">.</span><span class="n">gen</span><span class="p">(</span><span class="mi">0</span><span class="p">)</span>
<span class="p">(</span><span class="mi">1</span><span class="p">,</span> <span class="mi">1</span><span class="p">)</span>
</pre></div>
</div>
<p>TESTS:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">Adeles</span><span class="p">(</span><span class="n">QQ</span><span class="p">)</span><span class="o">.</span><span class="n">gen</span><span class="p">(</span><span class="mi">1</span><span class="p">)</span>
<span class="n">Traceback</span> <span class="p">(</span><span class="n">most</span> <span class="n">recent</span> <span class="n">call</span> <span class="n">last</span><span class="p">):</span>
<span class="o">...</span>
<span class="ne">IndexError</span><span class="p">:</span> <span class="n">n</span> <span class="n">must</span> <span class="n">be</span> <span class="mi">0</span>
</pre></div>
</div>
</dd></dl>

<dl class="py method">
<dt id="adeles.adele.Adeles.gens">
<code class="sig-name descname">gens</code><span class="sig-paren">(</span><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adeles.gens" title="Permalink to this definition">¶</a></dt>
<dd><p>Return a tuple of generators of this ring, which is <code class="docutils literal notranslate"><span class="pre">(1,)</span></code></p>
<p>EXAMPLES:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">Adeles</span><span class="p">()</span><span class="o">.</span><span class="n">gens</span><span class="p">()</span>
<span class="p">((</span><span class="mi">1</span><span class="p">,</span> <span class="mi">1</span><span class="p">),)</span>
</pre></div>
</div>
</dd></dl>

<dl class="py method">
<dt id="adeles.adele.Adeles.is_exact">
<code class="sig-name descname">is_exact</code><span class="sig-paren">(</span><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adeles.is_exact" title="Permalink to this definition">¶</a></dt>
<dd><p>Return <code class="docutils literal notranslate"><span class="pre">False</span></code>, indicating that doing arithmetic can lead to precision
loss</p>
<p>EXAMPLES:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">Adeles</span><span class="p">()</span><span class="o">.</span><span class="n">is_exact</span><span class="p">()</span>
<span class="kc">False</span>
</pre></div>
</div>
</dd></dl>

<dl class="py method">
<dt id="adeles.adele.Adeles.is_field">
<code class="sig-name descname">is_field</code><span class="sig-paren">(</span><em class="sig-param"><span class="n">proof</span><span class="o">=</span><span class="default_value">True</span></em><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adeles.is_field" title="Permalink to this definition">¶</a></dt>
<dd><p>Return <code class="docutils literal notranslate"><span class="pre">False</span></code>, indicating that this ring is not a field</p>
<p>EXAMPLES:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">Adeles</span><span class="p">()</span><span class="o">.</span><span class="n">is_field</span><span class="p">()</span>
<span class="kc">False</span>
</pre></div>
</div>
</dd></dl>

<dl class="py method">
<dt id="adeles.adele.Adeles.is_finite">
<code class="sig-name descname">is_finite</code><span class="sig-paren">(</span><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adeles.is_finite" title="Permalink to this definition">¶</a></dt>
<dd><p>Return <code class="docutils literal notranslate"><span class="pre">False</span></code>, indicating that this adèle ring is not finite</p>
<p>EXAMPLES:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">Adeles</span><span class="p">()</span><span class="o">.</span><span class="n">is_finite</span><span class="p">()</span>
<span class="kc">False</span>
</pre></div>
</div>
</dd></dl>

<dl class="py method">
<dt id="adeles.adele.Adeles.is_integral_domain">
<code class="sig-name descname">is_integral_domain</code><span class="sig-paren">(</span><em class="sig-param"><span class="n">proof</span><span class="o">=</span><span class="default_value">None</span></em><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adeles.is_integral_domain" title="Permalink to this definition">¶</a></dt>
<dd><p>Return <code class="docutils literal notranslate"><span class="pre">False</span></code>, indicating that this adèle ring is not an integral
domain</p>
<p>EXAMPLES:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">Adeles</span><span class="p">()</span><span class="o">.</span><span class="n">is_integral_domain</span><span class="p">()</span>
<span class="kc">False</span>
</pre></div>
</div>
</dd></dl>

<dl class="py method">
<dt id="adeles.adele.Adeles.ngens">
<code class="sig-name descname">ngens</code><span class="sig-paren">(</span><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adeles.ngens" title="Permalink to this definition">¶</a></dt>
<dd><p>Return the number of generators of this ring, which is <span class="math notranslate nohighlight">\(1\)</span></p>
<p>EXAMPLES:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">Adeles</span><span class="p">()</span><span class="o">.</span><span class="n">ngens</span><span class="p">()</span>
<span class="mi">1</span>
</pre></div>
</div>
</dd></dl>

<dl class="py method">
<dt id="adeles.adele.Adeles.number_field">
<code class="sig-name descname">number_field</code><span class="sig-paren">(</span><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adeles.number_field" title="Permalink to this definition">¶</a></dt>
<dd><p>Return the base number field of this adèle ring</p>
<p>EXAMPLES:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">K</span><span class="o">.&lt;</span><span class="n">a</span><span class="o">&gt;</span> <span class="o">=</span> <span class="n">NumberField</span><span class="p">(</span><span class="n">x</span><span class="o">^</span><span class="mi">5</span><span class="o">+</span><span class="mi">7</span><span class="o">*</span><span class="n">x</span><span class="o">+</span><span class="mi">9</span><span class="p">)</span>
<span class="n">sage</span><span class="p">:</span> <span class="n">Adeles</span><span class="p">(</span><span class="n">K</span><span class="p">)</span><span class="o">.</span><span class="n">number_field</span><span class="p">()</span>
<span class="n">Number</span> <span class="n">Field</span> <span class="ow">in</span> <span class="n">a</span> <span class="k">with</span> <span class="n">defining</span> <span class="n">polynomial</span> <span class="n">x</span><span class="o">^</span><span class="mi">5</span> <span class="o">+</span> <span class="mi">7</span><span class="o">*</span><span class="n">x</span> <span class="o">+</span> <span class="mi">9</span>
</pre></div>
</div>
</dd></dl>

<dl class="py method">
<dt id="adeles.adele.Adeles.order">
<code class="sig-name descname">order</code><span class="sig-paren">(</span><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adeles.order" title="Permalink to this definition">¶</a></dt>
<dd><p>Return <code class="docutils literal notranslate"><span class="pre">Infinity</span></code>, indicating that this ring has infinitely many
elements</p>
<p>EXAMPLES:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span><span class="n">sage</span><span class="p">:</span> <span class="n">Adeles</span><span class="p">()</span><span class="o">.</span><span class="n">order</span><span class="p">()</span>
<span class="o">+</span><span class="n">Infinity</span>
</pre></div>
</div>
</dd></dl>

<dl class="py method">
<dt id="adeles.adele.Adeles.random_element">
<code class="sig-name descname">random_element</code><span class="sig-paren">(</span><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adeles.random_element" title="Permalink to this definition">¶</a></dt>
<dd><p>Return a random element of this adèle ring</p>
<p>EXAMPLES:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: [Adeles().random_element() for i in range(8)] # random
[(0.27373183534599522?, 8 mod 9),
 (-0.093881488288479976?, 0 mod 7),
 (0.30161163018038062?, 2 mod 20),
 (0.41150508905962280?, -5),
 (-0.65571439239360441?, 1),
 (-0.73036548915661804?, 1/5 mod 13/5),
 (0.22238770477164250?, 1 mod 45/2),
 (-0.95472024452579408?, 5/3 mod 2)]
</pre></div>
</div>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: [Adeles(K).random_element() for i in range(8)] # random
[(0.79423215622331634?, -0.40137427709553509? - 0.64534892614076900?*I, 43/16*a^2 + 1/16*a - 1/16 mod (129/8*a^2 + 141/4*a + 21/4)),
 (0.52942291646206008?, -0.58341619510920518? + 0.36230656269735762?*I, 1/3*a^2 mod (2/3)),
 (0.89152090833818054?, 0.49795817189108283? - 0.70150555814011307?*I, 9*a - 2 mod (42)),
 (0.44924372673739877?, 0.26028465739297824? - 0.040401847180406625?*I, 0 mod (1/2)),
 (0.073877767325941424?, -0.91366841344236605? - 0.021723717207447813?*I, -6*a^2 + a mod (26*a + 13)),
 (-0.33577218142520793?, 0.29090471478072467? + 0.43029026051764663?*I, a^2 + 1/2*a + 1 mod (26)),
 (0.49505274874739480?, 0.24198576476487932? + 0.25729961424886950?*I, 1/4*a + 5/4 mod (5/4*a^2)),
 (-0.15573868218812215?, 0.12998234921383456? + 0.99415852426545226?*I, -2*a^2 mod (-a^2 - 1))]
</pre></div>
</div>
</dd></dl>

<dl class="py method">
<dt id="adeles.adele.Adeles.some_elements">
<code class="sig-name descname">some_elements</code><span class="sig-paren">(</span><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.Adeles.some_elements" title="Permalink to this definition">¶</a></dt>
<dd><p>Return some elements of this adèle ring</p>
<p>EXAMPLES:</p>
<div class="highlight-default notranslate"><div class="highlight"><pre><span></span>sage: Adeles().some_elements()
[(0, 0), (1, 2/5 mod 6/5), (1, 1), (4.571428571428572?, 17/7 mod 30/7)]
</pre></div>
</div>
</dd></dl>

</dd></dl>

<dl class="py class">
<dt id="adeles.adele.AdelizationFunctor">
<em class="property">class </em><code class="sig-prename descclassname">adeles.adele.</code><code class="sig-name descname">AdelizationFunctor</code><span class="sig-paren">(</span><em class="sig-param"><span class="n">args</span><span class="o">=</span><span class="default_value">None</span></em>, <em class="sig-param"><span class="n">kwds</span><span class="o">=</span><span class="default_value">None</span></em><span class="sig-paren">)</span><a class="headerlink" href="#adeles.adele.AdelizationFunctor" title="Permalink to this definition">¶</a></dt>
<dd><p>Bases: <code class="xref py py-class docutils literal notranslate"><span class="pre">sage.categories.pushout.ConstructionFunctor</span></code></p>
<p>The functor sending a number field to its adèle ring</p>
</dd></dl>

</div>
</div>


            <div class="clearer"></div>
          </div>
        </div>
      </div>
      <div class="sphinxsidebar" role="navigation" aria-label="main navigation">
        <div class="sphinxsidebarwrapper">
  <h3><a href="index.html">Table of Contents</a></h3>
  <ul>
<li><a class="reference internal" href="#">Adèles</a><ul>
<li><a class="reference internal" href="#examples-with-qq-adeles">Examples with <span class="math notranslate nohighlight">\(\QQ\)</span>-adèles</a></li>
<li><a class="reference internal" href="#adeles-over-number-fields">Adèles over Number Fields</a></li>
</ul>
</li>
</ul>

  <h4>Previous topic</h4>
  <p class="topless"><a href="completion.html"
                        title="previous chapter">Infinite Completions of Number Fields</a></p>
  <h4>Next topic</h4>
  <p class="topless"><a href="multiplicative_padic.html"
                        title="next chapter">Multiplicative <span class="math notranslate nohighlight">\(p\)</span>-adics</a></p>
  <div role="note" aria-label="source link">
    <h3>This Page</h3>
    <ul class="this-page-menu">
      <li><a href="_sources/adele.rst.txt"
            rel="nofollow">Show Source</a></li>
    </ul>
   </div>
<div id="searchbox" style="display: none" role="search">
  <h3 id="searchlabel">Quick search</h3>
    <div class="searchformwrapper">
    <form class="search" action="search.html" method="get">
      <input type="text" name="q" aria-labelledby="searchlabel" />
      <input type="submit" value="Go" />
    </form>
    </div>
</div>
<script>$('#searchbox').show(0);</script>
        </div>
      </div>
      <div class="clearer"></div>
    </div>
    <div class="related" role="navigation" aria-label="related navigation">
      <h3>Navigation</h3>
      <ul>
        <li class="right" style="margin-right: 10px">
          <a href="genindex.html" title="General Index"
             >index</a></li>
        <li class="right" >
          <a href="py-modindex.html" title="Python Module Index"
             >modules</a> |</li>
        <li class="right" >
          <a href="multiplicative_padic.html" title="Multiplicative \(p\)-adics"
             >next</a> |</li>
        <li class="right" >
          <a href="completion.html" title="Infinite Completions of Number Fields"
             >previous</a> |</li>
  
    
      <a href="../index.html"><img src="_static/logo_sagemath_black.svg" height="28" style="vertical-align: middle" title="Sage Logo"></a>
    
  
  
        <li class="nav-item nav-item-0"><a href="index.html">Home</a> &#187;</li>

        <li class="nav-item nav-item-this"><a href="">Adèles</a></li> 
      </ul>
    </div>
    
    <div class="footer" role="contentinfo">
        &#169; Copyright 2021, Mathé Hertogh.
      Created using <a href="https://www.sphinx-doc.org/">Sphinx</a> 3.1.2.
    </div>
    <script type="text/javascript">
/*global jQuery, window */
/* Sphinx sidebar toggle.  Putting this code at the end of the body
 * enables the toggle for the live, static, and offline docs.  Note:
 * sage.misc.html.math_parse() eats jQuery's dollar-sign shortcut. */
var jq = jQuery;
jq(document).ready(function () {
    var bar, bod, bg, fg, key, tog, wid_old, wid_new, get_state, set_state;
    bod = jq('div.bodywrapper');
    bar = jq('div.sphinxsidebar');
    tog = jq('<div class="sphinxsidebartoggle"></div>');

    /* The sidebar toggle adapts its height to the bodywrapper height. */
    const resizeObserver = new ResizeObserver(entries => {
        tog.height(bod.height());
    });
    resizeObserver.observe(bod[0]);

    /* Setup and add the toggle. See Sphinx v0.5.1 default.css. */
    fg = jq('div.sphinxsidebar p a').css('color') || 'rgb(152, 219, 204)';
    bg = jq('div.document').css('background-color') || 'rgb(28, 78, 99)';
    wid_old = '230px';
    wid_new = '5px';
    tog.css('background-color', bg)
        .css('border-width', '0px')
        .css('border-right', wid_new + ' ridge ' + bg)
        .css('cursor', 'pointer')
        .css('position', 'absolute')
        .css('left', '-' + wid_new)
        .css('top', '0px')
        .css('width', wid_new);
    bod.css('position', 'relative');
    bod.prepend(tog);

    /* Cookie helpers. */
    key = 'sphinxsidebar=';
    set_state = function (s) {
        var date = new Date();
        /* Expiry in 7 days. */
        date.setTime(date.getTime() + (7 * 24 * 3600 * 1000));
        document.cookie = key + encodeURIComponent(s) + '; expires=' +
            date.toUTCString() + '; path=/';
    };
    get_state = function () {
        var i, c, crumbs = document.cookie.split(';');
        for (i = 0; i < crumbs.length; i += 1) {
            c = crumbs[i].replace(/^\s+/, '');
            if (c.indexOf(key) === 0) {
                return decodeURIComponent(c.substring(key.length, c.length));
            }
        }
        return null;
    };

    /* Event handlers. */
    tog.mouseover(function (ev) {
        tog.css('border-right-color', fg);
    }).mouseout(function (ev) {
        tog.css('border-right-color', bg);
    }).click(function (ev) {
        if (bod.hasClass('wide')) {
            bod.removeClass('wide');
            bod.css('margin-left', wid_old);
            bar.css('width', wid_old);
            bar.show();
            set_state('visible');
        } else {
            set_state('hidden');
            bar.hide();
            bar.css('width', '0px');
            bod.css('margin-left', wid_new);
            bod.addClass('wide');
        }
    });

    /* Hide the normally visible sidebar? */
    if (get_state() === 'hidden') {
        tog.trigger('click');
    } else {
        set_state('visible');
    }
});
    </script>
  </body>
</html>